{"config": [{"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "dtype": "float32", "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_7", "trainable": false, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 96, 96, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_11", "trainable": false, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_7", "data_format": "channels_last", "trainable": false, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "strides": [1, 1], "kernel_size": [2, 2], "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_8", "trainable": false, "activation": "linear", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_12", "trainable": false, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_8", "data_format": "channels_last", "trainable": false, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "filters": 128, "strides": [1, 1], "kernel_size": [2, 2], "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_9", "trainable": false, "activation": "linear", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_13", "trainable": false, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_9", "data_format": "channels_last", "trainable": false, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "data_format": "channels_last", "trainable": false}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "name": "dense_7", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": false, "units": 500, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_14", "trainable": false, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "name": "dense_8", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": false, "units": 500, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_15", "trainable": false, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "name": "dense_9", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": false, "units": 30, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 4, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}