{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 96, 96, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "linear", "name": "conv2d_7", "use_bias": true, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_7", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [2, 2], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "linear", "name": "conv2d_8", "use_bias": true, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_8", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [2, 2], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activation": "linear", "name": "conv2d_9", "use_bias": true, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_9", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 500, "activity_regularizer": null, "name": "dense_7", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 500, "activity_regularizer": null, "name": "dense_8", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "units": 30, "activity_regularizer": null, "name": "dense_9", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential"}